
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 14 to add, 1 to change, 7 to destroy.</code></pre>

* Create
  * azurerm_api_management_api_diagnostic.api_logs[0]
  * module.api_mgmt_product.azurerm_api_management_product_policy.apim_product_policy[0]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;hmi-health-check&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;hmi-health-check&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;hmi-health-check&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;publication-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;update-publication&#34;]
* Update
  * module.api_mgmt_product.azurerm_api_management_product.product
* Replace
  * module.apim_apis.azurerm_api_management_api.apim_api
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;publication-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;update-publication&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;publication-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;update-publication&#34;]
  * module.apim_apis.azurerm_api_management_api_policy.apim_api_policy
  * module.apim_apis.azurerm_api_management_product_api.product


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_api_diagnostic.api_logs[0] will be created
  + resource "azurerm_api_management_api_diagnostic" "api_logs" {
      + always_log_errors         = true
      + api_management_logger_id  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/loggers/sds-api-mgmt-stg-logger"
      + api_management_name       = "sds-api-mgmt-stg"
      + api_name                  = "hmi-apim"
      + http_correlation_protocol = "W3C"
      + id                        = (known after apply)
      + identifier                = "applicationinsights"
      + log_client_ip             = true
      + operation_name_format     = "Name"
      + resource_group_name       = "ss-stg-network-rg"
      + sampling_percentage       = 25
      + verbosity                 = "verbose"

      + backend_request {
          + body_bytes     = 5000
          + headers_to_log = [
              + "Destination-System",
              + "Source-System",
              + "accept",
              + "content-type",
              + "origin",
              + "x-forwarded-for",
            ]
        }

      + backend_response {
          + body_bytes     = 5000
          + headers_to_log = [
              + "Destination-System",
              + "Source-System",
              + "content-length",
              + "content-type",
              + "origin",
              + "x-forwarded-for",
            ]
        }

      + frontend_request {
          + body_bytes     = (known after apply)
          + headers_to_log = (known after apply)

          + data_masking {
              + headers {
                  + mode  = (known after apply)
                  + value = (known after apply)
                }

              + query_params {
                  + mode  = (known after apply)
                  + value = (known after apply)
                }
            }
        }

      + frontend_response {
          + body_bytes     = 5000
          + headers_to_log = [
              + "Destination-System",
              + "Source-System",
              + "content-length",
              + "content-type",
              + "origin",
              + "x-forwarded-for",
            ]
        }
    }

  # module.api_mgmt_product.azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/hmi-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.api_mgmt_product.azurerm_api_management_product_policy.apim_product_policy[0] will be created
  + resource "azurerm_api_management_product_policy" "apim_product_policy" {
      + api_management_name = "sds-api-mgmt-stg"
      + id                  = (known after apply)
      + product_id          = "hmi-product-stg"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <send-request ignore-error="false" timeout="20" response-variable-name="rateCallLimit" mode="new">
                        <set-url>https://hmi-kv-stg.vault.azure.net/secrets/rate-call-limit/?api-version=7.0</set-url>
                        <set-method>GET</set-method>
                        <authentication-managed-identity resource="https://vault.azure.net" />
                    </send-request>
                    <set-variable name="rateCallLimit" value="@{
                            var secret = ((IResponse)context.Variables["rateCallLimit"]).Body.As<JObject>();
                            return secret["value"].ToString();
                        }" />
                    <rate-limit-by-key calls="@((int)context.Variables["rateCallLimit"])" renewal-period="60" counter-key="@(context.Request.Headers.GetValueOrDefault("X-Forwarded-For",""))" />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.apim_apis.data.azurerm_api_management_product.apim_product will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management_product" "apim_product" {
      + api_management_name   = "sds-api-mgmt-stg"
      + approval_required     = (known after apply)
      + description           = (known after apply)
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + product_id            = "hmi-product-stg"
      + published             = (known after apply)
      + resource_group_name   = "ss-stg-network-rg"
      + subscription_required = (known after apply)
      + subscriptions_limit   = (known after apply)
      + terms                 = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.apim_apis.azurerm_api_management_api.apim_api must be replaced
-/+ resource "azurerm_api_management_api" "apim_api" {
      ~ api_type              = "http" -> (known after apply)
      ~ display_name          = "hmi APIM API" -> "hmi apim API"
      ~ id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-APIM" -> (known after apply)
      ~ is_current            = true -> (known after apply)
      ~ is_online             = false -> (known after apply)
      ~ name                  = "hmi-APIM" -> "hmi-apim" # forces replacement
      ~ soap_pass_through     = false -> (known after apply)
      + version               = (known after apply)
      + version_set_id        = (known after apply)
        # (7 unchanged attributes hidden)

      ~ subscription_key_parameter_names {
          ~ header = "Ocp-Apim-Subscription-Key" -> (known after apply)
          ~ query  = "subscription-key" -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["hmi-health-check"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Health check for HMI"
      + display_name        = "HMI Health Check"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "hmi-health-check"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/"

      + request {
        }

      + response {
          + status_code = 200
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["publication-health"] must be replaced
-/+ resource "azurerm_api_management_api_operation" "apim_api_operation" {
      ~ api_name            = "hmi-APIM" -> "hmi-apim" # forces replacement
      ~ id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-APIM/operations/publication-health" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ request {

          + query_parameter {
              + default_value = "123"
              + name          = "artefact_id"
              + required      = true
              + type          = "string"
            }
        }

      + response {
          + status_code = 200
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["update-publication"] must be replaced
-/+ resource "azurerm_api_management_api_operation" "apim_api_operation" {
      ~ api_name            = "hmi-APIM" -> "hmi-apim" # forces replacement
      ~ id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-APIM/operations/update-publication" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ request {
          + header {
              + default_value = "CFT"
              + name          = "Source-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "CFT"
              + name          = "Destination-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "2019-10-12T07:20:00Z"
              + name          = "Request-Created-At"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Accept"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Content-Type"
              + required      = true
              + type          = "string"
            }
        }

      + response {
          + status_code = 201
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["hmi-health-check"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "hmi-health-check"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["publication-health"] must be replaced
-/+ resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      ~ api_name            = "hmi-APIM" -> "hmi-apim" # forces replacement
      ~ id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-APIM/operations/publication-health/policies/xml" -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ xml_content         = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["update-publication"] must be replaced
-/+ resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      ~ api_name            = "hmi-APIM" -> "hmi-apim" # forces replacement
      ~ id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-APIM/operations/update-publication/policies/xml" -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ xml_content         = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["hmi-health-check"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "health-check"
      + id               = (known after apply)
      + name             = "health-check"
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["publication-health"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "CaTH"
      + id               = (known after apply)
      + name             = "CaTH"
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["update-publication"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "CaTH"
      + id               = (known after apply)
      + name             = "CaTH"
    }

  # module.apim_apis.azurerm_api_management_api_policy.apim_api_policy must be replaced
-/+ resource "azurerm_api_management_api_policy" "apim_api_policy" {
      ~ api_name            = "hmi-APIM" -> "hmi-apim" # forces replacement
      ~ id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-APIM/policies/xml" -> (known after apply)
      ~ xml_content         = <<-EOT
            <policies>
          - 	<inbound>
          - 		<rewrite-uri template="/" copy-unmatched-params="true" />
          - 		<set-backend-service base-url="https://hmi-apim.test.policy.platform.hmcts.net/hmi/" />
          - 	</inbound>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          +     <inbound>
          +         <base />
          +         <validate-jwt header-name="Authorization" failed-validation-httpcode="401" failed-validation-error-message="Access denied due to invalid OAuth information">
          +             <openid-config url="https://sts.windows.net/531ff96d-0ae9-462a-8d2d-bec7c0b42082/.well-known/openid-configuration" />
          +             <audiences>
          +                 <audience>api://d49d7fa2-6904-4223-a907-3b8992af4190</audience>
          +             </audiences>
          +             <issuers>
          +                 <issuer>https://sts.windows.net/531ff96d-0ae9-462a-8d2d-bec7c0b42082/</issuer>
          +             </issuers>
          +             <required-claims>
          +                 <claim name="roles" match="all">
          +                     <value>hmiGateway</value>
          +                 </claim>
          +             </required-claims>
          +         </validate-jwt>
          +         <cors>
          +             <allowed-origins>
          +                 <origin>*</origin>
          +             </allowed-origins>
          +             <allowed-methods>
          +                 <method>GET</method>
          +                 <method>POST</method>
          +             </allowed-methods>
          +             <!-- No Headers -->
          +         </cors>
          +         <!-- set a header to enable mocks -->
          +         <set-header name="_EnableMocks" exists-action="override">
          +             <value>true</value>
          +         </set-header>
          +         <set-header name="Strict-Transport-Security" exists-action="override">
          +             <value>max-age=31536000</value>
          +         </set-header>
          +         <set-header name="Content-Security-Policy" exists-action="override">
          +             <value>script-src 'self'</value>
          +         </set-header>
          +         <set-header name="X-Content-Type-Options" exists-action="override">
          +             <value>nosniff</value>
          +         </set-header>
          +         <set-header name="Request-Processed-At" exists-action="override">
          +             <value>@(DateTime.Now.ToString("yyyy'-'MM'-'dd'T'HH':'mm':'ss'Z'"))</value>
          +         </set-header>
          +         <set-header name="transactionIdHMCTS" exists-action="skip">
          +             <value>@{
          +                 var guidBinary = new byte[16];
          +                 Array.Copy(Guid.NewGuid().ToByteArray(), 0, guidBinary, 0, 10);
          +                 long time = DateTime.Now.Ticks;
          +                 byte[] bytes = new byte[6];
          +                 unchecked
          +                 {
          +                     bytes[5] = (byte)(time >> 40);
          +                     bytes[4] = (byte)(time >> 32);
          +                     bytes[3] = (byte)(time >> 24);
          +                     bytes[2] = (byte)(time >> 16);
          +                     bytes[1] = (byte)(time >> 8);
          +                     bytes[0] = (byte)(time);
          +                 }
          +                 Array.Copy(bytes, 0, guidBinary, 10, 6);
          +                 return new Guid(guidBinary).ToString();
          +                 }</value>
          +         </set-header>
          +         <check-header name="Source-System" failed-check-httpcode="400" failed-check-error-message="Missing/Invalid Header Source-System" ignore-case="false">
          +             <value>SNL</value>
          +             <value>MOCK</value>
          +             <value>EMULATOR</value>
          +             <value>CRIME</value>
          +             <value>CFT</value>
          +             <value>RM</value>
          +             <value>CP</value>
          +         </check-header>
          +         <check-header name="Destination-System" failed-check-httpcode="400" failed-check-error-message="Missing/Invalid Header Destination-System" ignore-case="false">
          +             <value>SNL</value>
          +             <value>MOCK</value>
          +             <value>EMULATOR</value>
          +             <value>CRIME</value>
          +             <value>CFT</value>
          +             <value>ELINKS</value>
          +             <value>VH</value>
          +             <value>RM</value>
          +             <value>HMI-DTU</value>
          +             <value>PIH</value>
          +         </check-header>
          +         <check-header name="Request-Created-At" failed-check-httpcode="400" failed-check-error-message="Missing/Invalid Header Request-Created-At" ignore-case="true" />
          +         <check-header name="Accept" failed-check-httpcode="406" failed-check-error-message="Missing/Invalid Media Type" ignore-case="true">
          +             <value>application/json</value>
          +             <value>application/json; version=1.2</value><!--Additional header for passing McGirr tests -->
          +         </check-header>
          +         <check-header name="Content-Type" failed-check-httpcode="400" failed-check-error-message="Missing/Invalid Media Type" ignore-case="true">
          +             <value>application/json</value>
          +             <value>application/json;charset=UTF-8</value>
          +             <value>application/json; charset=UTF-8</value>
          +         </check-header>
          +         <choose>
          +             <when condition="@(context.Request.Headers["Request-Created-At"] == null)">
          +                 <return-response>
          +                     <set-status code="400" reason="Malformed request." />
          +                     <set-body>@{
          +                         return new JObject(
          +                         new JProperty("statusCode", 400),
          +                         new JProperty("message", "Missing/Invalid Header Request-Created-At")
          +                         ).ToString();
          +                         }</set-body>
          +                 </return-response>
          +             </when>
          +         </choose>
          +         <choose>
          +             <when condition="@(!Regex.IsMatch(context.Request.Headers.GetValueOrDefault("Request-Created-At",""), @"^((?:(\d{4}-(0[1-9]|1[0-2])-(0[1-9]|[1-2][0-9]|3[0-1]))T((2[0-3]|[01][0-9]):[0-5][0-9]:[0-5][0-9](?:\.\d+)?))(Z|[\+-](2[0-3]|[01][0-9]):[0-5][0-9])?)$"))">
          +                 <return-response>
          +                     <set-status code="400" reason="Bad request - &apos;Invalid Request-Created-At&apos; http header" />
          +                     <set-header name="Content-Type" exists-action="override">
          +                         <value>application/json</value>
          +                     </set-header>
          +                     <set-body>@(
          +                         new JObject(new JProperty("statusCode", 400),
          +                         new JProperty("message", "Missing/Invalid Header Request-Created-At")).ToString())</set-body>
          +                 </return-response>
          +             </when>
          +         </choose>
          +     </inbound>
          +     <backend>
          +         <base />
          +     </backend>
          +     <outbound>
          +         <base />
          +     </outbound>
          +     <on-error>
          +         <base />
          +     </on-error>
            </policies>
        EOT
        # (2 unchanged attributes hidden)
    }

  # module.apim_apis.azurerm_api_management_product_api.product must be replaced
-/+ resource "azurerm_api_management_product_api" "product" {
      ~ api_name            = "hmi-APIM" -> "hmi-apim" # forces replacement
      ~ id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/hmi-product-stg/apis/hmi-APIM" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 14 to add, 1 to change, 7 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":3,"Program":"tfcmt","SHA1":"","Vars":{}} -->